# Diameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRound..::..Diameter Property
StructuralSectionRound Class See Also
---
Pipe Diameter.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double Diameter { get; set; }
```

Visual Basic
---
```text
Public Property Diameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Diameter {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace